templates/ws-scan_getjobelements.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:sca="http://schemas.microsoft.com/windows/2006/08/wdp/scan">
	<soap:Header>
		<wsa:To>{{TO}}</wsa:To>
		<wsa:Action>http://schemas.microsoft.com/windows/2006/08/wdp/scan/GetJobElements</wsa:Action>
		<wsa:MessageID>urn:uuid:3b1a82a5-d671-496b-8aac-b05d6471d0c6</wsa:MessageID>
		<wsa:ReplyTo>
			<wsa:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address>
		</wsa:ReplyTo>
		<wsa:From>
			<wsa:Address>{{FROM}}</wsa:Address>
		</wsa:From>
	</soap:Header>
	<soap:Body>
		<sca:GetJobElements>
			<sca:JobId>{{JOB_ID}}</sca:JobId>
			<sca:RequestedElements>
				<sca:Name>sca:JobStatus</sca:Name>
				<sca:Name>sca:ScanTicket</sca:Name>
				<sca:Name>sca:Documents</sca:Name>
			</sca:RequestedElements>
		</sca:GetJobElements>
	</soap:Body>
</soap:Envelope>