ws-scan_getscannerelements.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:sca="http://schemas.microsoft.com/windows/2006/08/wdp/scan">
	<soap:Header>
		<wsa:To>http://192.168.1.5:80/wsd/scanservice.cgi</wsa:To>
		<wsa:Action>http://schemas.microsoft.com/windows/2006/08/wdp/scan/GetScannerElements</wsa:Action>
		<wsa:MessageID>urn:uuid:3b1a82a5-d671-496b-8aac-b05d6471d0c6</wsa:MessageID>
		<wsa:ReplyTo>
			<wsa:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address>
		</wsa:ReplyTo>
		<wsa:From>
			<wsa:Address>urn:uuid:c44ecd6c-fc77-49b2-88bf-be74d61db9d3</wsa:Address>
		</wsa:From>
	</soap:Header>
	<soap:Body>
		<sca:GetScannerElementsRequest>
			<sca:RequestedElements>
				<sca:Name>sca:ScannerStatus</sca:Name>
				<sca:Name>sca:ScannerDescription</sca:Name>
				<sca:Name>sca:ScannerConfiguration</sca:Name>
				<sca:Name>sca:DefaultScanTicket</sca:Name>
			</sca:RequestedElements>
		</sca:GetScannerElementsRequest>
	</soap:Body>
</soap:Envelope>