full-software/validateScanTicket.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:sca="http://schemas.microsoft.com/windows/2006/08/wdp/scan"><soap:Header><wsa:To>http://192.168.1.11:8018/wsd/scan</wsa:To><wsa:Action>http://schemas.microsoft.com/windows/2006/08/wdp/scan/ValidateScanTicket</wsa:Action><wsa:MessageID>urn:uuid:358f3619-16d5-4bf3-b547-0790d4673a29</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:From><wsa:Address>urn:uuid:fecf2a38-7547-4abf-9c91-3bc4c340d025</wsa:Address></wsa:From></soap:Header><soap:Body><sca:ValidateScanTicketRequest><sca:ScanTicket><sca:JobDescription><sca:JobName>Validating scan ticket for current WIA item properties</sca:JobName><sca:JobOriginatingUserName>WIA session run for DIZZLEPET\Dizzle on DIZZLEPET</sca:JobOriginatingUserName><sca:JobInformation>Scanning from platen..</sca:JobInformation></sca:JobDescription><sca:DocumentParameters><sca:Format sca:MustHonor="true">jfif</sca:Format><sca:ImagesToTransfer sca:MustHonor="true">1</sca:ImagesToTransfer><sca:InputSource sca:MustHonor="true">Platen</sca:InputSource><sca:InputSize sca:MustHonor="true"><sca:InputMediaSize><sca:Width>8504</sca:Width><sca:Height>11693</sca:Height></sca:InputMediaSize></sca:InputSize><sca:Exposure sca:MustHonor="true"><sca:ExposureSettings><sca:Contrast>0</sca:Contrast><sca:Brightness>0</sca:Brightness></sca:ExposureSettings></sca:Exposure><sca:Scaling sca:MustHonor="true"><sca:ScalingWidth>100</sca:ScalingWidth><sca:ScalingHeight>100</sca:ScalingHeight></sca:Scaling><sca:Rotation sca:MustHonor="true">0</sca:Rotation><sca:MediaSides><sca:MediaFront><sca:ScanRegion><sca:ScanRegionXOffset sca:MustHonor="true">0</sca:ScanRegionXOffset><sca:ScanRegionYOffset sca:MustHonor="true">0</sca:ScanRegionYOffset><sca:ScanRegionWidth>8503</sca:ScanRegionWidth><sca:ScanRegionHeight>11690</sca:ScanRegionHeight></sca:ScanRegion><sca:ColorProcessing sca:MustHonor="true">RGB24</sca:ColorProcessing><sca:Resolution sca:MustHonor="true"><sca:Width>300</sca:Width><sca:Height>300</sca:Height></sca:Resolution></sca:MediaFront></sca:MediaSides></sca:DocumentParameters></sca:ScanTicket></sca:ValidateScanTicketRequest></soap:Body></soap:Envelope>