submit_job.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:sca="http://schemas.microsoft.com/windows/2006/08/wdp/scan"><soap:Header><wsa:To>{{URL}}</wsa:To><wsa:Action>http://schemas.microsoft.com/windows/2006/08/wdp/scan/CreateScanJob</wsa:Action><wsa:MessageID>urn:uuid:add127e3-d263-46b3-a91a-bfc6e14220f0</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:From><wsa:Address>urn:uuid:5de7ada4-b6f9-4686-b9fa-a7fe01266a2a</wsa:Address></wsa:From></soap:Header><soap:Body><sca:CreateScanJobRequest><sca:ScanTicket><sca:JobDescription><sca:JobName>       WIA</sca:JobName><sca:JobOriginatingUserName> WIA   HOST\USER  HOST</sca:JobOriginatingUserName><sca:JobInformation>   ...</sca:JobInformation></sca:JobDescription><sca:DocumentParameters><sca:Format sca:MustHonor="true">exif</sca:Format></sca:DocumentParameters></sca:ScanTicket></sca:CreateScanJobRequest></soap:Body></soap:Envelope>
