templates/ws-scan__get_active_jobs.xml

<?xml version="1.0" encoding="ASCII"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
               xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
               xmlns:wscn="http://schemas.microsoft.com/windows/2006/08/wdp/scan">
    <soap:Header>
        <wsa:To>{{TO}}</wsa:To>
        <wsa:Action>http://schemas.microsoft.com/windows/2006/08/wdp/scan/GetActiveJobs</wsa:Action>
        <wsa:From>
            <wsa:Address>{{FROM}}</wsa:Address>
        </wsa:From>
        <wsa:MessageID>{{MSG_ID}}</wsa:MessageID>
        <wsa:ReplyTo>
            <wsa:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address>
        </wsa:ReplyTo>
    </soap:Header>
    <soap:Body>
        <wscn:GetActiveJobsRequest/>
    </soap:Body>
</soap:Envelope>