RetrieveImage.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:sca="http://schemas.microsoft.com/windows/2006/08/wdp/scan"><soap:Header><wsa:To>http://HOST:PORT/wsd/scan</wsa:To><wsa:Action>http://schemas.microsoft.com/windows/2006/08/wdp/scan/RetrieveImage</wsa:Action><wsa:MessageID>urn:uuid:a4efe3da-7c46-4ab4-a5b0-542007641b0c</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:From><wsa:Address>urn:uuid:fecf2a38-7547-4abf-9c91-3bc4c340d025</wsa:Address></wsa:From></soap:Header><soap:Body><sca:RetrieveImageRequest><sca:JobId>22</sca:JobId><sca:JobToken>ScanJob0</sca:JobToken><sca:DocumentDescription><sca:DocumentName>Scanned image file for the WSD Scan Driver</sca:DocumentName></sca:DocumentDescription></sca:RetrieveImageRequest></soap:Body></soap:Envelope>
