request_image.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:sca="http://schemas.microsoft.com/windows/2006/08/wdp/scan"><soap:Header><wsa:To>{{URL}}</wsa:To><wsa:Action>http://schemas.microsoft.com/windows/2006/08/wdp/scan/RetrieveImage</wsa:Action><wsa:MessageID>urn:uuid:b533cab8-5f73-4d6d-bafe-f4bf645bc4d2</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:From><wsa:Address>urn:uuid:5de7ada4-b6f9-4686-b9fa-a7fe01266a2a</wsa:Address></wsa:From></soap:Header><soap:Body><sca:RetrieveImageRequest><sca:JobId>{{JOBID}}</sca:JobId><sca:JobToken>[DestToken]Scan</sca:JobToken><sca:DocumentDescription><sca:DocumentName>      WSD</sca:DocumentName></sca:DocumentDescription></sca:RetrieveImageRequest></soap:Body></soap:Envelope>
