full-software/getAttrib.xml

<?xml version="1.0" encoding="utf-8"?><soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope" xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing" xmlns:sca="http://schemas.microsoft.com/windows/2006/08/wdp/scan"><soap:Header><wsa:To>http://192.168.1.11:8018/wsd/scan</wsa:To><wsa:Action>http://schemas.microsoft.com/windows/2006/08/wdp/scan/GetScannerElements</wsa:Action><wsa:MessageID>urn:uuid:baf9de74-9162-425c-a3da-2f572607c01d</wsa:MessageID><wsa:ReplyTo><wsa:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address></wsa:ReplyTo><wsa:From><wsa:Address>urn:uuid:fecf2a38-7547-4abf-9c91-3bc4c340d025</wsa:Address></wsa:From></soap:Header><soap:Body><sca:GetScannerElementsRequest><sca:RequestedElements><sca:Name>sca:ScannerStatus</sca:Name></sca:RequestedElements></sca:GetScannerElementsRequest></soap:Body></soap:Envelope>