src/PyWSD/templates/ws-scan__retrieve_image.xml

<?xml version="1.0" encoding="utf-8"?>
<soap:Envelope xmlns:soap="http://www.w3.org/2003/05/soap-envelope"
               xmlns:wsa="http://schemas.xmlsoap.org/ws/2004/08/addressing"
               xmlns:sca="http://schemas.microsoft.com/windows/2006/08/wdp/scan">
	<soap:Header>
		<wsa:To>{{TO}}</wsa:To>
		<wsa:Action>http://schemas.microsoft.com/windows/2006/08/wdp/scan/RetrieveImage</wsa:Action>
        <wsa:MessageID>{{MSG_ID}}</wsa:MessageID>
		<wsa:ReplyTo>
			<wsa:Address>http://schemas.xmlsoap.org/ws/2004/08/addressing/role/anonymous</wsa:Address>
		</wsa:ReplyTo>
		<wsa:From>
			<wsa:Address>{{FROM}}</wsa:Address>
		</wsa:From>
	</soap:Header>
	<soap:Body>
		<sca:RetrieveImageRequest>
			<sca:JobId>{{JOB_ID}}</sca:JobId>
			<sca:JobToken>{{JOB_TOKEN}}</sca:JobToken>
			<sca:DocumentDescription>
				<sca:DocumentName>{{DOC_DESCR}}</sca:DocumentName>
			</sca:DocumentDescription>
		</sca:RetrieveImageRequest>
	</soap:Body>
</soap:Envelope>